const printName = require("./export");

printName("김재하");

/*
1. *재사용성(파일단위), *유지보수(독립성), 가독성(한 js 내에)
2. 모듈 단위로 js 파일을 통해 분리된 개발이 가능한 컴포넌트 기반의 프론트 엔드 프레임워크
   (vue, react ...)
*/

/*
왜 할까요?

1. 많은 곳에서 아용하려고
2. 재사용성
3. 유지보수
4. 한 곳에서만 코드 작성하면 복잡해져서
5. 함수의 중복선언을 막으려고
6. 한 페이지에 코드 길어지는게 싫어서
7. 협업하려고
8. 깃 올릴 때 하나씩 임포트하는 방식?
9. 여러사람이 만드는 기능이다?
10. 기능별로 이름을 지어주고 싶다
11. 코드끼리 연관되지 않게 독립적으로 쓰려고

단점

한 곳에서 코드가 정리되면 나중에 그 페이지 내에서 찾기 힘들거 같다
모듈 개수가 많아진다
귀찮아
파일이 너무 많아지고 보기 힘들 것
안에 뭐 들어있는지 다큐멘테이션이 없으면 읽기 힘들어진다
관리하기 어려울 것 같다


*/
